tests/load/script.yml
# Thank you for trying serverless-artillery!
# This default script is intended to get you started quickly.
# There is a lot more that Artillery can do.
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/
config:
  # this hostname will be used as a prefix for each URI in the flow unless a complete URI is specified
  # dev
  # target: "https://recommendation-api.getpocket.dev"

  # prod
  target: "https://recommendation-api.getpocket.dev"

  plugins:
    expect: {}
    cloudwatch:
      namespace: serverless-artillery-recommendation-api-loadtest
  phases:
    - duration: 900
      arrivalRate: 5
      rampTo: 15
      name: "Warm up recommendation-api 15req/sec"

    - duration: 900
      arrivalRate: 15
      rampTo: 15
      name: "Sustain load 15req/sec"
  defaults:
    headers:
      Content-Type: application/json

scenarios:

  - name: "getSlate"
    flow:
      - post:
          url: "/"
          body: '{"query":"query get_slate{ getSlate(slateId: \"this-is-a-test-dont-use-it\") { recommendations{ itemId publisher } } }","variables":null,"operationName":"get_slate"}'
          headers:
             Content-Type: application/json
          expect:
            - statusCode: 200
            - contentType: json